# Первый и четвертый варианты решения похожи по принципу(используется цикл),
# но первый вариант хорошо себя показывает при небольших значениях N,а при возрастании скорость начинает уменьшаться.
# Четвертый вариант,наоборот,показывает бОльшее время при небольших объемах данных,но при больших работает быстрее.

# Примерно одинаковая сложность у второго и третьего вариантов, но решение с помощью словаря(второе)
# работает быстрее как при маленьких,так и при больших объемах данных.

# У всех четырех вариантов нет ограничений на объем данных,так как не используется рекурсия.
# Лучший вариант - под №2.
